#+TITLE: Emacs Configuration

** gnus

Sanitized version of .authinfo.gpg for Gmail IMAP and SMTP.

#+begin_src sh :results output
gpg --batch -d ~/.authinfo.gpg | awk '/\.gmail\.com/{$4="EMAIL";$6="PASSWORD";print}'
#+end_src

#+RESULTS:
: machine imap.gmail.com login EMAIL password PASSWORD port imaps
: machine smtp.gmail.com login EMAIL password PASSWORD port 587

#+begin_src sh :results output
pass show imap.gmail.com | sed -e '1s/.*/PASSWORD/' -e '/user:/s/[^ ]*$/EMAIL/'
#+end_src

#+RESULTS:
: PASSWORD
: user: EMAIL
: port: imaps

#+begin_src sh :results output
pass show smtp.gmail.com | sed -e '1s/.*/PASSWORD/' -e '/user:/s/[^ ]*$/EMAIL/'
#+end_src

#+RESULTS:
: PASSWORD
: user: EMAIL
: port: smtp

#+begin_src emacs-lisp
(use-package gnus
  :defer t
  :config
  ;; Use secondary-select-methods
  (setq gnus-select-method '(nnnil ""))

  ;; Gmane (mailing lists)
  (add-to-list 'gnus-secondary-select-methods
               '(nntp "news.gmane.io"))
  ;; Gwene (RSS feeds)
  (add-to-list 'gnus-secondary-select-methods
               '(nntp "news.gwene.org"))

  ;; Fastmail
  ;; (add-to-list 'gnus-secondary-select-methods
  ;;              '(nnimap "imap.fastmail.com"))

  ;; Uncomment to record all IMAP commands in the ‘"*imap log*"’
  ;; (setq nnimap-record-commands t)

  ;; Skip prompt: "Gnus auto-save file exists. Do you want to read it?"
  (setq gnus-always-read-dribble-file t
        ;; Mark sent messages as read
        gnus-gcc-mark-as-read t
        gnus-inhibit-startup-message t)
  :init
  ;; gnus-home-directory must be set before gnus loads
  (setq gnus-home-directory (concat user-emacs-directory "gnus/"))
  (setq message-directory (concat user-emacs-directory "Mail/"))
  ;; TODO: nnfolder-directory is still set to ~/Mail/archive
  (setq nnfolder-directory (concat message-directory "archive")))
#+end_src

** ob-go

#+begin_src go
package main

import "fmt"

func main() {
        fmt.Println("Hello, world")
}
#+end_src

#+RESULTS:
: Hello, world

#+begin_src emacs-lisp
(use-package ob-go)
#+end_src

** ob-rust

Requires [[https://github.com/fornwall/rust-script][rust-script]].

#+begin_src rust
for count in 0..2 {
    println!("{}. Hello World!", count);
}
#+end_src

#+RESULTS:
: 0. Hello World!
: 1. Hello World!

#+begin_src emacs-lisp
(use-package ob-rust)
#+end_src

*** TODO: org-babel calc fix

Evaluating org-babel calc blocks can produce an error. Here's a reproduce case:

Works:

#+begin_src calc :exports both
1 (sample) * 0.2 (dollar/sample)
#+end_src

#+RESULTS:
: 0.2 dollar

Fails:

#+begin_src calc :exports both
10 (sample) * 0.2 (dollar/sample)
#+end_src

#+begin_example
math-normalize-fancy: Wrong type argument: number-or-marker-p, (float 2 0)
#+end_example

The following patched =org-babel-execute:calc= fixes the error:

#+begin_src emacs-lisp :tangle no
(defun org-babel-execute:calc (body params)
  "Execute a block of calc code with Babel."
  (unless (get-buffer "*Calculator*")
    (save-window-excursion (calc) (calc-quit)))
  (let* ((vars (org-babel--get-vars params))
	 (org--var-syms (mapcar #'car vars))
	 (var-names (mapcar #'symbol-name org--var-syms)))
    (mapc
     (lambda (pair)
       (calc-push-list (list (cdr pair)))
       (calc-store-into (car pair)))
     vars)
    (mapc
     (lambda (line)
       (when (> (length line) 0)
	 (cond
	  ;; simple variable name
	  ((member line var-names) (calc-recall (intern line)))
	  ;; stack operation
	  ((string= "'" (substring line 0 1))
	   (funcall (lookup-key calc-mode-map (substring line 1)) nil))
	  ;; complex expression
	  (t
	   (calc-push-list
	    (list (let ((res (calc-eval line)))
                    (cond
                     ((numberp res) res)
                     ;; Svend: Patch to fix `Wrong type argument: number-or-marker-p` errora
                     ;; ((math-read-number res) (math-read-number res))
                     ((listp res) (error "Calc error \"%s\" on input \"%s\""
                                         (cadr res) line))
                     (t (replace-regexp-in-string
                         "'" ""
                         (calc-eval
                          (math-evaluate-expr
                           ;; resolve user variables, calc built in
                           ;; variables are handled automatically
                           ;; upstream by calc
                           (mapcar #'org-babel-calc-maybe-resolve-var
                                   ;; parse line into calc objects
                                   (car (math-read-exprs line)))))))))
                  ))))))
     (mapcar #'org-trim
	     (split-string (org-babel-expand-body:calc body params) "[\n\r]"))))
  (save-excursion
    (with-current-buffer (get-buffer "*Calculator*")
      (prog1
        (calc-eval (calc-top 1))
        (calc-pop 1)))))
#+end_src

